app/Http/Controllers/TaskController.php

select * from `tasks`
---
    public function index()
    {
        $tasks = Task::all();

insert into `tasks` (`title`, `body`, `updated_at`, `created_at`) values ('aaaaaa', 'aaaaaaaaaa', '2021-09-22 09:46:37', '2021-09-22 09:46:37')
---
    public function store(TaskRequest $request)
    {
        $task = new Task;

        $task->title = $request->title;
        $task->body = $request->body;

        $task->save();

update `tasks` set `title` = 'あpppppp', `body` = ';;;;ppppp' where `id` = 7
---
    public function update(TaskRequest $request, $id)
    {
        $task = Task::find($id);

        $task->title = $request->title;
        $task->body = $request->body;

        $task->save();

delete from `tasks` where `id` = 8
---
    public function destroy($id)
    {
        $task = Task::find($id);
        $task->delete();